#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.naming.random_string.main: Refreshing state... [id=xaqd901wm45cchd8swjo9bu2xky7uxi666j8utydh6nbwgvjmkngvgrw49ob]
module.naming.random_string.first_letter: Refreshing state... [id=r]
tls_private_key.main: Refreshing state... [id=c04556899d55eb9eaaa3649617f6691722001e4b]
data.github_repository_environments.adv: Reading...
data.github_repository_environments.adv: Read complete after 1s [id=terraform-poc]
data.azurerm_client_config.current: Reading...
data.azurerm_resource_group.adv: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lYzMxYTY2My03YTFhLTQyOTEtYTQyMS1mMzFiM2FkNTQ0MzA7b2JqZWN0SWQ9MWU2NzczMzYtNzIwYS00YjY3LTg2ZjEtZWEzZTJmNWM5M2Q5O3N1YnNjcmlwdGlvbklkPWFkOWQwNTI5LTQ5YmYtNDU5YS04NmIyLWRjYjZmY2JmOWYzZDt0ZW5hbnRJZD05MzA3YTM1OC01MTZmLTRmY2QtYTgwZi01NWNmMThlNGU1MjA=]
data.azurerm_resource_group.adv: Read complete after 1s [id=/subscriptions/ad9d0529-49bf-459a-86b2-dcb6fcbf9f3d/resourceGroups/rg-adv-tf-demo-dev]
azurerm_virtual_network.adv: Refreshing state... [id=/subscriptions/ad9d0529-49bf-459a-86b2-dcb6fcbf9f3d/resourceGroups/rg-adv-tf-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-advapp-dev]
azurerm_subnet.adv: Refreshing state... [id=/subscriptions/ad9d0529-49bf-459a-86b2-dcb6fcbf9f3d/resourceGroups/rg-adv-tf-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-advapp-dev/subnets/snet-advapp-dev]
azurerm_network_interface.adv: Refreshing state... [id=/subscriptions/ad9d0529-49bf-459a-86b2-dcb6fcbf9f3d/resourceGroups/rg-adv-tf-demo-dev/providers/Microsoft.Network/networkInterfaces/nic-advapp-dev]
azurerm_linux_virtual_machine.adv: Refreshing state... [id=/subscriptions/ad9d0529-49bf-459a-86b2-dcb6fcbf9f3d/resourceGroups/rg-adv-tf-demo-dev/providers/Microsoft.Compute/virtualMachines/vm-advapp-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_environment_secret.vm_ssh_key will be created
  + resource "github_actions_environment_secret" "vm_ssh_key" {
      + created_at      = (known after apply)
      + environment     = "dev"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "terraform-poc"
      + secret_name     = "VM_SSH_KEY"
      + updated_at      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @tapansam, Action: `pull_request`*